; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=32, out_folder=htg/blocksworld/training, instance_id=12, seed=2036, goal_proportion=0.1

(define (problem blocksworld-12)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 - object)
 (:init 
    (arm-empty)
    (clear b24)
    (on-table b24)
    (clear b15)
    (on b15 b10)
    (on b10 b6)
    (on b6 b17)
    (on b17 b25)
    (on-table b25)
    (clear b12)
    (on b12 b9)
    (on b9 b11)
    (on-table b11)
    (clear b32)
    (on-table b32)
    (clear b16)
    (on b16 b7)
    (on b7 b2)
    (on b2 b21)
    (on b21 b8)
    (on-table b8)
    (clear b31)
    (on b31 b27)
    (on b27 b23)
    (on b23 b29)
    (on b29 b3)
    (on b3 b22)
    (on b22 b13)
    (on-table b13)
    (clear b26)
    (on b26 b18)
    (on b18 b5)
    (on b5 b1)
    (on b1 b14)
    (on b14 b28)
    (on-table b28)
    (clear b30)
    (on-table b30)
    (clear b19)
    (on b19 b20)
    (on b20 b4)
    (on-table b4))
 (:goal  (and 
    (clear b3)
    (on b3 b2)
    (on-table b2)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b16 b7)
   deleted: (on b16 b7) (clear b16) (arm-empty)
   added: (holding b16) (clear b7)
   goals met: 0 of 5
2. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 5
3. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 0 of 5
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 5
5. (unstack b2 b21)
   deleted: (on b2 b21) (clear b2) (arm-empty)
   added: (holding b2) (clear b21)
   goals met: 0 of 5
6. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 5
7. (unstack b26 b18)
   deleted: (on b26 b18) (clear b26) (arm-empty)
   added: (holding b26) (clear b18)
   goals met: 1 of 5
8. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 5
9. (unstack b18 b5)
   deleted: (on b18 b5) (clear b18) (arm-empty)
   added: (holding b18) (clear b5)
   goals met: 1 of 5
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 5
11. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 2 of 5
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 5
13. (unstack b1 b14)
   deleted: (on b1 b14) (clear b1) (arm-empty)
   added: (holding b1) (clear b14)
   goals met: 1 of 5
14. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 5
15. (unstack b31 b27)
   deleted: (on b31 b27) (clear b31) (arm-empty)
   added: (holding b31) (clear b27)
   goals met: 3 of 5
16. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 5
17. (unstack b27 b23)
   deleted: (on b27 b23) (clear b27) (arm-empty)
   added: (holding b27) (clear b23)
   goals met: 3 of 5
18. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 5
19. (unstack b23 b29)
   deleted: (on b23 b29) (clear b23) (arm-empty)
   added: (holding b23) (clear b29)
   goals met: 3 of 5
20. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 3 of 5
21. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 4 of 5
22. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 4 of 5
23. (unstack b3 b22)
   deleted: (on b3 b22) (clear b3) (arm-empty)
   added: (holding b3) (clear b22)
   goals met: 3 of 5
24. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 5 of 5
